XOLTResultP.xml

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>APOLLO42 M</ns3:Username><ns3:Password>Fight9091479</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>DD51945E636B0D08</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:PickupCreationRequest><ns1:Request><ns1:RequestOption>1</ns1:RequestOption></ns1:Request><ns2:RatePickupIndicator>N</ns2:RatePickupIndicator><ns2:Shipper><ns2:Account><ns2:AccountNumber>5R9E77</ns2:AccountNumber><ns2:AccountCountryCode>US</ns2:AccountCountryCode></ns2:Account></ns2:Shipper><ns2:PickupDateInfo><ns2:CloseTime>1400</ns2:CloseTime><ns2:ReadyTime>0500</ns2:ReadyTime><ns2:PickupDate>20100104</ns2:PickupDate></ns2:PickupDateInfo><ns2:PickupAddress><ns2:CompanyName>Pickup Proxy</ns2:CompanyName><ns2:ContactName>Pickup Manager</ns2:ContactName><ns2:AddressLine>315 Saddle Bridge Drive</ns2:AddressLine><ns2:Room>RO1</ns2:Room><ns2:Floor>2</ns2:Floor><ns2:City>Allendale</ns2:City><ns2:StateProvince>NJ</ns2:StateProvince><ns2:Urbanization></ns2:Urbanization><ns2:PostalCode>07401</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode><ns2:ResidentialIndicator>Y</ns2:ResidentialIndicator><ns2:PickupPoint>Lobby</ns2:PickupPoint><ns2:Phone><ns2:Number>6785851399</ns2:Number><ns2:Extension>911</ns2:Extension></ns2:Phone></ns2:PickupAddress><ns2:AlternateAddressIndicator>Y</ns2:AlternateAddressIndicator><ns2:PickupPiece><ns2:ServiceCode>001</ns2:ServiceCode><ns2:Quantity>27</ns2:Quantity><ns2:DestinationCountryCode>US</ns2:DestinationCountryCode><ns2:ContainerCode>01</ns2:ContainerCode></ns2:PickupPiece><ns2:TotalWeight><ns2:Weight>5.5</ns2:Weight><ns2:UnitOfMeasurement>LBS</ns2:UnitOfMeasurement></ns2:TotalWeight><ns2:OverweightIndicator>N</ns2:OverweightIndicator><ns2:PaymentMethod>01</ns2:PaymentMethod><ns2:SpecialInstruction>Test</ns2:SpecialInstruction><ns2:ReferenceNumber></ns2:ReferenceNumber></ns2:PickupCreationRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><pkup:PickupCreationResponse xmlns:pkup="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus></common:Response><pkup:PRN>2929602E9CP</pkup:PRN><pkup:RateStatus><pkup:Code>04</pkup:Code><pkup:Description>Rate not requested</pkup:Description></pkup:RateStatus></pkup:PickupCreationResponse></soapenv:Body></soapenv:Envelope>
